---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData.TotalConnectedCurrent
source: html/86c8a1b4-6ca6-5c1c-635f-f365b5ae9c3c.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData.TotalConnectedCurrent Property

The total connected current of the analytical power source.

## Syntax (C#)
```csharp
public double TotalConnectedCurrent { get; }
```